#Факториалом числа натурального числа n называется произведение чисел от 1 до n включительно. Факториалом нуля называют единицу. Написать программу нахождения факториала данного числа. Реализовать через рекурсию и без рекурсии. Вывести на экран факториалы от десяти первых чисел.

def factorial(n):
    fact = 1
    for i in range(1, n + 1):
        fact *= i
    return fact
for n in range(1, 11):
    print(factorial(n))

#с рекурсией:

def factorial_recursive(n):
    if n == 0:
        return 1
    if n == 1:
        return n
    else:
        return n*factorial_recursive(n-1)
for n in range(1, 10):
    print(factorial_recursive(n))